var x = 6;
var y = 14;
var z = 4;
var res;

document.write(`Ми маємо три значення x = ${x}, y = ${y}, z = ${z} з якими ми сьогодні попрацюємо. <br><br><br><br><br>
Перший наш приклад: x += y - x++ * z <br><br>
x += 14 - 6++ * 4 <br>
За встановленими правилами асоціативності проиоритету операторів наші приклади будуть вирішуватись з права на ліво <br>
так як наш інкремент являється постфіксним, то це значення зміниться на наступній строчці, при вирішуванні буде не 7, <br>
а 6, бо значення 7 наш x прийме на наступній строчці, тому спершу ми помножемо -6 * 4 = -24 <br>
x += 14 - 24 <br>
Далі до -24 додамо 14, буде дорівнювати -10, після цього розкладаємо оператор додавання з присвоєнням <br>
x = 6 + (-10) <br> 
Та вихідне значення ми отримуємо x = -4. <br>`);

x += y - x++ * z;

document.write(`${x}<br><br><br>`);

x = 6;
y = 14;
z = 4;

document.write(`Другий приклад: z = --x - y * 5 <br><br>
В цьому прикладі приймаємо до уваги префіксний декремент, тому х в цьому прикладі одразу буде дорівнювати 5 <br>
у (14) помножуємо на 5, дорівнює 70, далі 5 віднімаємо від 70 (тому що стоїть унарний мінус перед нашим у) <br>
Та наше значення z буде дорівнювати -65 <br>`);

z = --x - y * 5;
document.write(`${z} <br><br><br>`);

x = 6;
y = 14;
z = 4;

document.write(`Третій приклад: y /= x + 5 % z <br><br>
В данному прикладі ми зіштовхуємось з діленням з присвоєнням та з остачею від ділення, але й тут все просто <br>
Остача від ділення 5 % 4 буде дорівнювати одному, додаємо 6 + 1, буде дорівнювати 7: y /= 7 <br>
Далі розкладаємо ділення з присвоєнням: y = 14 / 7, та отримуємо y = 2 <br>`);

y /= x + 5 % z;
document.write(`${y} <br><br><br>`);

x = 6;
y = 14;
z = 4;

document.write(`Четвертий приклад: z - x++ + y * 5 <br><br>
Також в цілому нічого складного, тільки так як немає знаку присвоєння, то ми додамо змінну res в яку запишемо результат <br>
Так як інкремент постфіксний, то значення залишатиметься 6, тому спочатку помножуємо 14 на 5, отримуємо 70 <br>
Далі 70 - 6 (не забуваємо про унарний мінус) + 4, та отримуємо результат який дорівнює 68 <br>`);

res = z - x++ + y * 5;

document.write(`${res} <br><br>`);

x = 6;
y = 14;
z = 4;
res = 0;

document.write(`П'ятий приклад: x = y - x++ * z <br><br>
Приклад такий же як і перший, але в ньому відсутнє додавання з присвоєнням, тому буде трохи легше <br>
Не забуваємо про постфіксний інкремент та унарний мінус, 6 * 4 = 24, 14 - 24 = -10 <br>`);

x = y - x++ * z;

document.write(x);